Repository: JouichatH/DAQARA-pipeline
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: fr

source: Filters out solver-specific keyword arguments before calling `predict`.
fr: Filtre les arguments de mots-clés spécifiques au solveur avant d'appeler `predict`.

source: Data for which to make predictions. Original code did not explicitly require DataFrame here, but subsequent steps often assume it.
fr: Données pour lesquelles faire des prédictions. Le code original ne nécessitait pas explicitement de DataFrame ici, mais les étapes suivantes le supposent souvent.

source: Additional keyword arguments for the pipeline's predict method. Keys 'step', 'max_rate', 'grid_points', 'use_grid_search' are removed.
fr: Arguments de mots-clés supplémentaires pour la méthode predict du pipeline. Les clés 'step', 'max_rate', 'grid_points', 'use_grid_search' sont supprimées.

source: **predictions** -- Raw predictions from the pipeline.
fr: **predictions** -- Prédictions brutes du pipeline.

source: If the underlying pipeline prediction fails.
fr: Si la prédiction du pipeline sous-jacent échoue.

source: Generate response curves (output vs. 'x1') for samples.
fr: Générer des courbes de réponse (sortie vs 'x1') pour les échantillons.

source: Processes each row in `X` independently. For each sample, it uses a solver (`solver_method`) to find the 'x1' value (`x1_max`) needed to reach the `target` pH. It then predicts outputs across a range of 'x1' values from 0 to `x1_max`. Includes a 'highlight' point if the original sample had an 'x1' value.
fr: Traite chaque ligne de `X` indépendamment. Pour chaque échantillon, il utilise un solveur (`solver_method`) pour trouver la valeur 'x1' (`x1_max`) nécessaire pour atteindre le pH `target`. Il prédit ensuite les sorties sur une plage de valeurs 'x1' de 0 à `x1_max`. Inclut un point 'highlight' si l'échantillon original avait une valeur 'x1'.

source: Input data samples. Must be a DataFrame. Must contain `initialpH_col` (non-NaN) if `predicts_delta_ph` is True.
fr: Échantillons de données d'entrée. Doit être un DataFrame. Doit contenir `initialpH_col` (non-NaN) si `predicts_delta_ph` est True.

source: Number of points for the response curve [0, x1_max]. Must be >= 2.
fr: Nombre de points pour la courbe de réponse [0, x1_max]. Doit être >= 2.

source: The target pH used by the solver. Defaults to `self.target_ph`.
fr: Le pH cible utilisé par le solveur. Par défaut `self.target_ph`.

source: Method used to find `x1_max`.
fr: Méthode utilisée pour trouver `x1_max`.

source: Additional arguments passed to the solver function and subsequently to `predict_raw` for curve generation.
fr: Arguments supplémentaires passés à la fonction solveur et ensuite à `predict_raw` pour la génération de la courbe.

source: **results** -- List of dictionaries, one per input sample. Each contains: 'x1_max': Solved 'x1' (float or np.nan). 'x1_candidates': Array of 'x1' values for curve (shape `(num_points,)`). 'predictions': List of corresponding formatted predictions. 'highlight': Tuple `(provided_x1, prediction)` or None.
fr: **results** -- Liste de dictionnaires, un par échantillon d'entrée. Chacun contient : 'x1_max' : 'x1' résolu (float ou np.nan). 'x1_candidates' : Tableau des valeurs 'x1' pour la courbe (forme `(num_points,)`). 'predictions' : Liste des prédictions formatées correspondantes. 'highlight' : Tuple `(provided_x1, prediction)` ou None.

source: If `fit` has not been called.
fr: Si `fit` n'a pas été appelé.

source: If required columns missing/NaN, or `num_points` invalid.
fr: Si les colonnes requises sont manquantes/NaN, ou si `num_points` est invalide.

source: If solver or prediction calls fail critically.
fr: Si les appels au solveur ou à la prédiction échouent de manière critique.

source: Request metadata passed to the ``predict`` method.
fr: Demander les métadonnées passées à la méthode ``predict``.

source: Note that this method is only relevant if ``enable_metadata_routing=True`` (see :func:`sklearn.set_config`). Please see :ref:`User Guide <metadata_routing>` on how the routing mechanism works.
fr: Notez que cette méthode n'est pertinente que si ``enable_metadata_routing=True`` (voir :func:`sklearn.set_config`). Veuillez consulter le :ref:`Guide de l'utilisateur <metadata_routing>` sur le fonctionnement du mécanisme de routage.

source: The options for each parameter are:
fr: Les options pour chaque paramètre sont :

source: ``True``: metadata is requested, and passed to ``predict`` if provided. The request is ignored if metadata is not provided.
fr: ``True`` : les métadonnées sont demandées et transmises à ``predict`` si elles sont fournies. La demande est ignorée si les métadonnées ne sont pas fournies.

source: ``False``: metadata is not requested and the meta-estimator will not pass it to ``predict``.
fr: ``False`` : les métadonnées ne sont pas demandées et le méta-estimateur ne les transmettra pas à ``predict``.

source: ``None``: metadata is not requested, and the meta-estimator will raise an error if the user provides it.
fr: ``None`` : les métadonnées ne sont pas demandées, et le méta-estimateur lèvera une erreur si l'utilisateur les fournit.

source: ``str``: metadata should be passed to the meta-estimator with this given alias instead of the original name.
fr: ``str`` : les métadonnées doivent être transmises au méta-estimateur avec cet alias donné au lieu du nom original.

source: The default (``sklearn.utils.metadata_routing.UNCHANGED``) retains the existing request. This allows you to change the request for some parameters and not others.
fr: La valeur par défaut (``sklearn.utils.metadata_routing.UNCHANGED``) conserve la demande existante. Cela vous permet de modifier la demande pour certains paramètres et pas d'autres.

source: This method is only relevant if this estimator is used as a sub-estimator of a meta-estimator, e.g. used inside a :class:`~sklearn.pipeline.Pipeline`. Otherwise it has no effect.
fr: Cette méthode n'est pertinente que si cet estimateur est utilisé comme sous-estimateur d'un méta-estimateur, par ex. utilisé à l'intérieur d'un :class:`~sklearn.pipeline.Pipeline`. Sinon, elle n'a aucun effet.

source: Metadata routing for ``num_points`` parameter in ``predict``.
fr: Routage des métadonnées pour le paramètre ``num_points`` dans ``predict``.

source: Metadata routing for ``solver_method`` parameter in ``predict``.
fr: Routage des métadonnées pour le paramètre ``solver_method`` dans ``predict``.

source: Metadata routing for ``target`` parameter in ``predict``.
fr: Routage des métadonnées pour le paramètre ``target`` dans ``predict``.

source: **self** -- The updated object.
fr: **self** -- L'objet mis à jour.

source: Solve for 'x1' using root-finding (for one sample).
fr: Résoudre pour 'x1' en utilisant la recherche de racine (pour un échantillon).

source: Finds the 'x1' value for a single input `sample` that results in a predicted final pH exactly equal to `target`, using `scipy.optimize.brentq`. Optionally performs a preliminary grid search.
fr: Trouve la valeur 'x1' pour un seul échantillon d'entrée `sample` qui résulte en un pH final prédit exactement égal à `target`, en utilisant `scipy.optimize.brentq`. Effectue éventuellement une recherche préliminaire sur grille.

source: The input sample. Must contain required features (incl. non-NaN `initialpH_col` if `predicts_delta_ph` is True) except 'x1'.
fr: L'échantillon d'entrée. Doit contenir les caractéristiques requises (y compris `initialpH_col` non-NaN si `predicts_delta_ph` est True) sauf 'x1'.

source: The target pH value to achieve.
fr: La valeur de pH cible à atteindre.

source: Specific bounds (min_x1, max_x1) for the solver search. If None, defaults to `self.x1_bounds`.
fr: Limites spécifiques (min_x1, max_x1) pour la recherche du solveur. Si None, utilise par défaut `self.x1_bounds`.

source: If True, performs a coarse grid search within `bounds` to find a narrower interval for `brentq`.
fr: Si True, effectue une recherche grossière sur grille dans `bounds` pour trouver un intervalle plus étroit pour `brentq`.

source: Number of points for the preliminary grid search if `use_grid_search` is True.
fr: Nombre de points pour la recherche préliminaire sur grille si `use_grid_search` est True.

source: Additional arguments passed to `self.predict_raw` after filtering.
fr: Arguments supplémentaires passés à `self.predict_raw` après filtrage.

source: **x1_solution** -- The 'x1' value found, or `np.nan` if solving fails.
fr: **x1_solution** -- La valeur 'x1' trouvée, ou `np.nan` si la résolution échoue.

source: If sample type is invalid.
fr: Si le type d'échantillon est invalide.

source: If required columns are missing or initial pH is NaN (when needed), or grid parameters invalid.
fr: Si les colonnes requises sont manquantes ou si le pH initial est NaN (lorsque nécessaire), ou si les paramètres de la grille sont invalides.

source: If prediction within the solver objective function fails.
fr: Si la prédiction dans la fonction objectif du solveur échoue.

source: Solve for 'x1' using vectorized grid search (for one sample).
fr: Résoudre pour 'x1' en utilisant une recherche vectorisée sur grille (pour un échantillon).

source: Finds the lowest 'x1' value (>= 0) for a single input `sample` that results in a predicted final pH >= `target`. Uses a grid search.
fr: Trouve la plus petite valeur 'x1' (>= 0) pour un seul échantillon d'entrée `sample` qui résulte en un pH final prédit >= `target`. Utilise une recherche sur grille.

source: *Note: Original code used `max_rate=100` as default in one place.*
fr: *Note : Le code original utilisait `max_rate=100` par défaut à un endroit.*

source: The target pH value to achieve or exceed.
fr: La valeur de pH cible à atteindre ou dépasser.

source: The step size for the 'x1' grid search.
fr: La taille du pas pour la recherche sur grille 'x1'.

source: Maximum 'x1' value for the grid search. If None, defaults to `self.x1_bounds[1]`. *(Original default was 100 here)*.
fr: Valeur maximale 'x1' pour la recherche sur grille. Si None, utilise par défaut `self.x1_bounds[1]`. *(La valeur par défaut originale était 100 ici)*.

source: Additional arguments passed to `self.predict` (used recursively in original) or `self.predict_raw`. Using `predict_raw` avoids infinite recursion.
fr: Arguments supplémentaires passés à `self.predict` (utilisé récursivement dans l'original) ou `self.predict_raw`. L'utilisation de `predict_raw` évite la récursion infinie.

source: **x1_solution** -- The lowest 'x1' value found that meets the target, or `np.nan`.
fr: **x1_solution** -- La plus petite valeur 'x1' trouvée qui atteint la cible, ou `np.nan`.

source: If required columns are missing or initial pH is NaN (when needed).
fr: Si les colonnes requises sont manquantes ou si le pH initial est NaN (lorsque nécessaire).

source: If prediction within the solver fails.
fr: Si la prédiction dans le solveur échoue.
