Repository: JouichatH/DAQARA-pipeline
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: fr

source: API Reference
fr: Référence API

source: Ensure a specific feature ('x1') is present in the data.
fr: Assure la présence d'une caractéristique spécifique ('x1') dans les données.

source: This transformer checks if a designated feature, referred to as 'x1', exists in the input data `X`. If the feature is missing, it adds a new column/feature at the specified position or with the specified name, filling it with `fill_value`. It handles both pandas DataFrames and NumPy/sparse arrays.
fr: Ce transformateur vérifie si une caractéristique désignée, appelée 'x1', existe dans les données d'entrée `X`. Si la caractéristique est manquante, il ajoute une nouvelle colonne/caractéristique à la position spécifiée ou avec le nom spécifié, en la remplissant avec `fill_value`. Il gère à la fois les DataFrames pandas et les tableaux NumPy/sparse.

source: For DataFrames, using `x1_col` is recommended for clarity. If provided, it prioritizes finding/adding the column by name and ensures it's at (or moved to) the `x1_index`. If `x1_col` is None or the input is an array, it relies on `x1_index` to check/add the feature at that position.
fr: Pour les DataFrames, l'utilisation de `x1_col` est recommandée pour plus de clarté. S'il est fourni, il priorise la recherche/l'ajout de la colonne par nom et s'assure qu'elle se trouve à (ou est déplacée vers) `x1_index`. Si `x1_col` est None ou si l'entrée est un tableau, il se base sur `x1_index` pour vérifier/ajouter la caractéristique à cette position.

source: Parameters
fr: Paramètres

source: The zero-based index where the 'x1' feature should be located. Used primarily for array inputs or as the target position for `x1_col` in DataFrames.
fr: L'indice de base zéro où la caractéristique 'x1' doit être située. Utilisé principalement pour les entrées de tableau ou comme position cible pour `x1_col` dans les DataFrames.

source: The value used to populate the 'x1' feature if it needs to be added.
fr: La valeur utilisée pour remplir la caractéristique 'x1' si elle doit être ajoutée.

source: The expected name of the 'x1' feature column if `X` is a pandas DataFrame. If provided: - If the column is missing, it's inserted at `x1_index` with this name. - If the column exists but is not at `x1_index`, it's moved. If None, the transformer operates based on `x1_index` only.
fr: Le nom attendu de la colonne de caractéristique 'x1' si `X` est un DataFrame pandas. Si fourni : - Si la colonne est manquante, elle est insérée à `x1_index` avec ce nom. - Si la colonne existe mais n'est pas à `x1_index`, elle est déplacée. Si None, le transformateur fonctionne basé sur `x1_index` uniquement.

source: Fit transformer.
fr: Ajuster le transformateur.

source: This transformer does not learn anything from the data, so this method just returns self.
fr: Ce transformateur n'apprend rien des données, donc cette méthode retourne simplement self.

source: The input data. Ignored.
fr: Les données d'entrée. Ignoré.

source: Ignored.
fr: Ignoré.

source: Returns
fr: Retours

source: **self** -- Returns the instance itself.
fr: **self** -- Retourne l'instance elle-même.

source: Return type
fr: Type de retour

source: Ensure the 'x1' feature is present.
fr: Assure la présence de la caractéristique 'x1'.

source: Adds the 'x1' feature column/feature if it's missing, filled with `fill_value`. If `X` is a DataFrame and `x1_col` is specified, it ensures the column exists with that name and attempts to place it at `x1_index`.
fr: Ajoute la colonne/caractéristique 'x1' si elle est manquante, remplie avec `fill_value`. Si `X` est un DataFrame et `x1_col` est spécifié, il s'assure que la colonne existe avec ce nom et tente de la placer à `x1_index`.

source: The input data to transform, shape (n_samples, n_features).
fr: Les données d'entrée à transformer, forme (n_samples, n_features).

source: **X_transformed** -- The data with the 'x1' feature ensured. Returns a DataFrame if the input was a DataFrame, otherwise returns a NumPy array. Note: Sparse matrix inputs may be converted to dense NumPy arrays.
fr: **X_transformed** -- Les données avec la caractéristique 'x1' assurée. Retourne un DataFrame si l'entrée était un DataFrame, sinon retourne un tableau NumPy. Note : Les entrées de matrice sparse peuvent être converties en tableaux NumPy denses.

source: Interpolates spectral data columns to a common grid.
fr: Interpole les colonnes de données spectrales sur une grille commune.

source: Selects specified spectral columns from the input DataFrame, interpolates them onto a new grid defined by `min_value`, `max_value`, and `step`, using an external `interpolate_spectra` function. The original spectral columns are dropped, and the new interpolated columns are appended.
fr: Sélectionne les colonnes spectrales spécifiées du DataFrame d'entrée, les interpole sur une nouvelle grille définie par `min_value`, `max_value` et `step`, en utilisant une fonction externe `interpolate_spectra`. Les colonnes spectrales originales sont supprimées, et les nouvelles colonnes interpolées sont ajoutées.

source: Names of the columns containing the spectral data to be interpolated.
fr: Noms des colonnes contenant les données spectrales à interpoler.

source: Minimum value (e.g., wavelength) for the target interpolation grid. Used as a fixed parameter.
fr: Valeur minimale (par ex., longueur d'onde) pour la grille d'interpolation cible. Utilisée comme paramètre fixe.

source: Maximum value (e.g., wavelength) for the target interpolation grid. Used as a fixed parameter.
fr: Valeur maximale (par ex., longueur d'onde) pour la grille d'interpolation cible. Utilisée comme paramètre fixe.

source: The step size for the target interpolation grid.
fr: La taille du pas pour la grille d'interpolation cible.

source: Whether the underlying `interpolate_spectra` function should be allowed to extrapolate beyond the original data's range.
fr: Indique si la fonction sous-jacente `interpolate_spectra` doit être autorisée à extrapoler au-delà de la plage des données d'origine.

source: No learning is needed as parameters are fixed during initialization. Returns self.
fr: Aucun apprentissage n'est nécessaire car les paramètres sont fixés lors de l'initialisation. Retourne self.

source: Interpolate spectral columns.
fr: Interpoler les colonnes spectrales.

source: Selects `spectral_columns`, interpolates them using `interpolate_spectra` with the fixed parameters `min_value`, `max_value`, `step`, `extrapolate`. Drops the original `spectral_columns`, and appends the new interpolated columns.
fr: Sélectionne `spectral_columns`, les interpole en utilisant `interpolate_spectra` avec les paramètres fixes `min_value`, `max_value`, `step`, `extrapolate`. Supprime les `spectral_columns` originales, et ajoute les nouvelles colonnes interpolées.

source: Input data containing the `spectral_columns`. Must be a DataFrame.
fr: Données d'entrée contenant les `spectral_columns`. Doit être un DataFrame.

source: **X_transformed** -- Data with original spectral columns replaced by interpolated ones.
fr: **X_transformed** -- Données avec les colonnes spectrales originales remplacées par les colonnes interpolées.

source: Raises
fr: Lève

source: If `X` is not a pandas DataFrame.
fr: Si `X` n'est pas un DataFrame pandas.

source: If `spectral_columns` are missing in `X`.
fr: Si `spectral_columns` sont manquantes dans `X`.

source: If the external `interpolate_spectra` function fails.
fr: Si la fonction externe `interpolate_spectra` échoue.

source: Applies scaling to specific columns and spectral pretreatments.
fr: Applique la mise à l'échelle à des colonnes spécifiques et des prétraitements spectraux.

source: This transformer performs two main actions:
fr: Ce transformateur effectue deux actions principales :

source: Scales specified non-spectral numeric columns (`specific_columns`) using `sklearn.preprocessing.StandardScaler`. The original columns are dropped and replaced by new columns with a `_scaled` suffix. The scaler is fitted during the `fit` method.
fr: Met à l'échelle les colonnes numériques non spectrales spécifiées (`specific_columns`) en utilisant `sklearn.preprocessing.StandardScaler`. Les colonnes originales sont supprimées et remplacées par de nouvelles colonnes avec un suffixe `_scaled`. Le scaler est ajusté pendant la méthode `fit`.

source: Applies a sequence of spectral preprocessing steps (`preprocessing_steps`) to the designated `spectral_columns` using an external `apply_pretreatments` function. These columns are modified *in place* during the `transform` method.
fr: Applique une séquence d'étapes de prétraitement spectral (`preprocessing_steps`) aux `spectral_columns` désignées en utilisant une fonction externe `apply_pretreatments`. Ces colonnes sont modifiées *en place* pendant la méthode `transform`.

source: Names of the columns containing spectral data to which `preprocessing_steps` will be applied.
fr: Noms des colonnes contenant les données spectrales auxquelles `preprocessing_steps` sera appliqué.

source: Names of non-spectral numeric columns to be scaled using StandardScaler. If None or empty, no scaling is performed. If provided, must be a list.
fr: Noms des colonnes numériques non spectrales à mettre à l'échelle en utilisant StandardScaler. Si None ou vide, aucune mise à l'échelle n'est effectuée. Si fourni, doit être une liste.

source: Configuration defining the sequence of preprocessing steps (e.g., ['snv', 'savgol']) passed to the `apply_pretreatments` function.
fr: Configuration définissant la séquence des étapes de prétraitement (par ex., ['snv', 'savgol']) passée à la fonction `apply_pretreatments`.

source: The fitted scaler instance used for `specific_columns`. Set during `fit` only if `specific_columns` is not empty.
fr: L'instance de scaler ajustée utilisée pour `specific_columns`. Définie pendant `fit` uniquement si `specific_columns` n'est pas vide.

source: The names generated for the scaled versions of `specific_columns`. Determined during `fit`.
fr: Les noms générés pour les versions mises à l'échelle de `specific_columns`. Déterminés pendant `fit`.

source: The original code did not explicitly store ``n_features_in_`` or
fr: Le code original ne stockait pas explicitement ``n_features_in_`` ou

source: Fit the preprocessor.
fr: Ajuster le préprocesseur.

source: Fits the StandardScaler on `specific_columns` if they are provided. Validates the presence of required columns in the input data `X`.
fr: Ajuste le StandardScaler sur `specific_columns` s'ils sont fournis. Valide la présence des colonnes requises dans les données d'entrée `X`.

source: The training input samples. Must be a DataFrame.
fr: Les échantillons d'entrée d'entraînement. Doit être un DataFrame.

source: **self** -- Fitted transformer.
fr: **self** -- Transformateur ajusté.

source: If `specific_columns` are provided but missing in `X`.
fr: Si `specific_columns` sont fournies mais manquantes dans `X`.

source: Apply scaling and spectral preprocessing.
fr: Appliquer la mise à l'échelle et le prétraitement spectral.

source: The input samples to transform. Must be a DataFrame.
fr: Les échantillons d'entrée à transformer. Doit être un DataFrame.

source: **X_transformed** -- The transformed data with scaled columns (if any) replacing originals, and spectral columns modified in place. Column order may change.
fr: **X_transformed** -- Les données transformées avec les colonnes mises à l'échelle (le cas échéant) remplaçant les originales, et les colonnes spectrales modifiées en place. L'ordre des colonnes peut changer.

source: If `fit` has not been called (specifically, if `scaler_` is needed but has not been fitted).
fr: Si `fit` n'a pas été appelé (spécifiquement, si `scaler_` est nécessaire mais n'a pas été ajusté).

source: If required columns (`specific_columns` during scaling, or `spectral_columns` during pretreatment) are missing in `X`, or if spectral column names cannot be converted to float for wavelengths.
fr: Si les colonnes requises (`specific_columns` pendant la mise à l'échelle, ou `spectral_columns` pendant le prétraitement) sont manquantes dans `X`, ou si les noms des colonnes spectrales ne peuvent pas être convertis en float pour les longueurs d'onde.

source: If the external `apply_pretreatments` function fails.
fr: Si la fonction externe `apply_pretreatments` échoue.

source: Reorders DataFrame columns to a desired order.
fr: Réorganise les colonnes du DataFrame dans un ordre souhaité.

source: Selects and reorders columns of an input DataFrame according to the `desired_order` list. Columns present in the input DataFrame but not in `desired_order` are dropped.
fr: Sélectionne et réorganise les colonnes d'un DataFrame d'entrée selon la liste `desired_order`. Les colonnes présentes dans le DataFrame d'entrée mais pas dans `desired_order` sont supprimées.

source: A list containing the column names in the desired output order. All names in this list must exist in the input DataFrame during `transform`.
fr: Une liste contenant les noms des colonnes dans l'ordre de sortie souhaité. Tous les noms de cette liste doivent exister dans le DataFrame d'entrée pendant `transform`.

source: No fitting is needed; just returns self.
fr: Aucun ajustement n'est nécessaire ; retourne simplement self.

source: Reorder DataFrame columns.
fr: Réorganiser les colonnes du DataFrame.

source: Selects columns specified in `desired_order` from `X` and returns them in that specific order.
fr: Sélectionne les colonnes spécifiées dans `desired_order` à partir de `X` et les retourne dans cet ordre spécifique.

source: The input DataFrame whose columns need reordering. `n_features` must be >= number of columns in `desired_order`.
fr: Le DataFrame d'entrée dont les colonnes doivent être réorganisées. `n_features` doit être >= au nombre de colonnes dans `desired_order`.

source: Ignored. Present for API consistency.
fr: Ignoré. Présent pour la cohérence de l'API.

source: **X_reordered** -- DataFrame containing only the columns from `desired_order`, in that order.
fr: **X_reordered** -- DataFrame contenant uniquement les colonnes de `desired_order`, dans cet ordre.

source: If any column listed in `desired_order` is not found in `X`.
fr: Si une colonne listée dans `desired_order` n'est pas trouvée dans `X`.

source: Wraps a pipeline for pH prediction with 'x1' solving capabilities.
fr: Encapsule un pipeline pour la prédiction du pH avec des capacités de résolution pour 'x1'.

source: This estimator wraps a scikit-learn pipeline (expected to perform preprocessing and prediction). It adds specialized functionality for scenarios involving pH prediction where a key input feature (designated 'x1', e.g., titration rate) might be known or might need to be determined algorithmically to achieve a specific target pH output.
fr: Cet estimateur encapsule un pipeline scikit-learn (censé effectuer le prétraitement et la prédiction). Il ajoute des fonctionnalités spécialisées pour les scénarios impliquant la prédiction du pH où une caractéristique d'entrée clé (désignée 'x1', par ex., le taux de titrage) peut être connue ou devoir être déterminée algorithmiquement pour atteindre un pH cible spécifique.

source: Key features include standard prediction, automatic fallback to solving if 'x1' is missing, direct solver access, response curve generation, and flexible output formatting for delta pH or final pH models.
fr: Les caractéristiques clés incluent la prédiction standard, le repli automatique vers la résolution si 'x1' est manquant, l'accès direct au solveur, la génération de courbes de réponse et le formatage flexible de la sortie pour les modèles de pH delta ou de pH final.

source: The underlying pipeline responsible for data transformation and making raw predictions. Must be a fitted or fit-able pipeline.
fr: Le pipeline sous-jacent responsable de la transformation des données et de la réalisation des prédictions brutes. Doit être un pipeline ajusté ou ajustable.

source: The name of the column in the input DataFrame containing the initial pH values. Required and used only if `predicts_delta_ph` is True.
fr: Le nom de la colonne dans le DataFrame d'entrée contenant les valeurs initiales de pH. Requis et utilisé uniquement si `predicts_delta_ph` est True.

source: The name of the column in the input DataFrame representing the 'x1' feature (e.g., 'Rate (Titration)'). This is the feature that can be solved for. *(Note: Original parameter name was `x1_index`, but used like a column name)*.
fr: Le nom de la colonne dans le DataFrame d'entrée représentant la caractéristique 'x1' (par ex., 'Rate (Titration)'). C'est la caractéristique qui peut être résolue. *(Note : Le nom du paramètre original était `x1_index`, mais utilisé comme un nom de colonne)*.

source: The default lower and upper bounds for the 'x1' feature when using solver methods (`solve_for_x1`, `predict_with_sampling`).
fr: Les limites inférieure et supérieure par défaut pour la caractéristique 'x1' lors de l'utilisation des méthodes de solveur (`solve_for_x1`, `predict_with_sampling`).

source: Determines the output format of `predict` and results from `predict_with_sampling` when `predicts_delta_ph` is True: - 'delta': Output the predicted change in pH. - 'ph': Output the calculated final pH. - 'both': Output a dictionary `{'delta': ..., 'pH': ...}`. If `predicts_delta_ph` is False, this parameter is ignored (output is final pH).
fr: Détermine le format de sortie de `predict` et les résultats de `predict_with_sampling` lorsque `predicts_delta_ph` est True : - 'delta' : Sortir le changement de pH prédit. - 'ph' : Sortir le pH final calculé. - 'both' : Sortir un dictionnaire `{'delta': ..., 'pH': ...}`. Si `predicts_delta_ph` est False, ce paramètre est ignoré (la sortie est le pH final).

source: Indicates whether the underlying `pipeline` predicts the change in pH (True) or the final pH directly (False).
fr: Indique si le `pipeline` sous-jacent prédit le changement de pH (True) ou le pH final directement (False).

source: The default target pH value used by the solver methods if not overridden.
fr: La valeur de pH cible par défaut utilisée par les méthodes du solveur si elle n'est pas surchargée.

source: The value used internally or by pipeline steps when 'x1' is missing or needs to be determined by the solver.
fr: La valeur utilisée en interne ou par les étapes du pipeline lorsque 'x1' est manquant ou doit être déterminé par le solveur.

source: Names of features seen during `fit`, captured from the input DataFrame `X`. Set during `fit`, None otherwise.
fr: Noms des caractéristiques vues pendant `fit`, capturés à partir du DataFrame d'entrée `X`. Défini pendant `fit`, None sinon.

source: The type of object expected for the `pipeline` parameter.
fr: Le type d'objet attendu pour le paramètre `pipeline`.

source: The root-finding algorithm used by `solve_for_x1`.
fr: L'algorithme de recherche de racine utilisé par `solve_for_x1`.

source: Requires input data `X` to be a pandas DataFrame for most methods.
fr: Nécessite que les données d'entrée `X` soient un DataFrame pandas pour la plupart des méthodes.

source: The `x1_index` parameter acts as the column name for the 'x1' feature.
fr: Le paramètre `x1_index` agit comme le nom de colonne pour la caractéristique 'x1'.

source: Assumes the underlying `pipeline` is correctly configured to handle the data transformations and has a `predict` method.
fr: Suppose que le `pipeline` sous-jacent est correctement configuré pour gérer les transformations de données et possède une méthode `predict`.

source: Solver methods rely on the relationship between 'x1' and predicted pH.
fr: Les méthodes du solveur dépendent de la relation entre 'x1' et le pH prédit.

source: Fit the underlying pipeline.
fr: Ajuster le pipeline sous-jacent.

source: Stores the feature names from the input DataFrame `X` and then calls the `fit` method of the wrapped `pipeline`.
fr: Stocke les noms des caractéristiques du DataFrame d'entrée `X` puis appelle la méthode `fit` du `pipeline` encapsulé.

source: Training data. Must contain `initialpH_col` if `predicts_delta_ph` is True. Must be a DataFrame.
fr: Données d'entraînement. Doit contenir `initialpH_col` si `predicts_delta_ph` est True. Doit être un DataFrame.

source: Target values corresponding to `X`.
fr: Valeurs cibles correspondant à `X`.

source: **self** -- The fitted wrapper instance.
fr: **self** -- L'instance de wrapper ajustée.

source: If `predicts_delta_ph` is True and `initialpH_col` is missing.
fr: Si `predicts_delta_ph` est True et `initialpH_col` est manquant.

source: If the underlying pipeline fitting fails.
fr: Si l'ajustement du pipeline sous-jacent échoue.

source: Predict target values for X.
fr: Prédire les valeurs cibles pour X.

source: Uses the pipeline's raw prediction if the 'x1' column (`self.x1_index`) exists and is not all NaN. Otherwise, falls back to `predict_with_sampling`. Formats output based on `self.response` and `self.predicts_delta_ph`.
fr: Utilise la prédiction brute du pipeline si la colonne 'x1' (`self.x1_index`) existe et n'est pas entièrement NaN. Sinon, se replie sur `predict_with_sampling`. Formate la sortie en fonction de `self.response` et `self.predicts_delta_ph`.

source: Input data for prediction. Must be a DataFrame. Must contain `initialpH_col` if `predicts_delta_ph` is True.
fr: Données d'entrée pour la prédiction. Doit être un DataFrame. Doit contenir `initialpH_col` si `predicts_delta_ph` est True.

source: Number of points for response curve if `predict_with_sampling` is triggered.
fr: Nombre de points pour la courbe de réponse si `predict_with_sampling` est déclenché.

source: Target pH for solver if `predict_with_sampling` is triggered. Defaults to `self.target_ph`.
fr: pH cible pour le solveur si `predict_with_sampling` est déclenché. Par défaut `self.target_ph`.

source: Solver method to use if `predict_with_sampling` is triggered. *(Note: Original code passed 'vectorized' only to one solver type)*.
fr: Méthode de solveur à utiliser si `predict_with_sampling` est déclenché. *(Note : Le code original passait 'vectorized' uniquement à un type de solveur)*.

source: Additional arguments. Solver-specific ones are used by solvers, others are passed to `predict_raw`.
fr: Arguments supplémentaires. Ceux spécifiques au solveur sont utilisés par les solveurs, les autres sont passés à `predict_raw`.

source: **predictions** -- - If predicting directly: A pandas Series (dtype float or object) or a list of dictionaries (if `response='both'`). - If solving/sampling: Returns the output of `predict_with_sampling` (a list of dictionaries).
fr: **predictions** -- - Si prédiction directe : Une Series pandas (dtype float ou object) ou une liste de dictionnaires (si `response='both'`). - Si résolution/échantillonnage : Retourne la sortie de `predict_with_sampling` (une liste de dictionnaires).

source: If predicting directly: A pandas Series (dtype float or object) or a list of dictionaries (if `response='both'`).
fr: Si prédiction directe : Une Series pandas (dtype float ou object) ou une liste de dictionnaires (si `response='both'`).

source: If solving/sampling: Returns the output of `predict_with_sampling` (a list of dictionaries).
fr: Si résolution/échantillonnage : Retourne la sortie de `predict_with_sampling` (une liste de dictionnaires).

source: If required columns are missing or contain NaNs when needed.
fr: Si les colonnes requises sont manquantes ou contiennent des NaN lorsque nécessaire.

source: If prediction or formatting fails.
fr: Si la prédiction ou le formatage échoue.

source: Call the predict method of the underlying pipeline directly.
fr: Appelle directement la méthode predict du pipeline sous-jacent.
